#coding=utf-8
import random
import time
import os

def creat_file(num):
    xing = '赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛\
    奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹'
    ming = '梦琪;忆柳;之桃;慕青;问兰;尔岚;元香;初夏;沛菡;傲珊;曼文;乐菱;痴珊;恨玉;惜文;香寒;新柔;\
    语蓉;海安;夜蓉;涵柏;水桃;醉蓝;春儿;语琴;从彤;傲晴;语兰;又菱;碧彤;元霜;怜梦;紫寒;妙彤;曼易;南莲;\
    紫翠;雨寒;易烟;如萱;若南;寻真;晓亦;向珊;慕灵;以蕊;寻雁;映易;雪柳;孤岚;笑霜;海云;凝天;沛珊;寒云;\
    冰旋;宛儿;绿真;盼儿;晓霜;碧凡;夏菡;曼香;若烟;半梦;雅绿;冰蓝;灵槐;平安;书翠;翠风;香巧;代云;梦曼;\
    幼翠;友巧;听寒;梦柏;醉易;访旋;亦玉;凌萱;访卉;怀亦;笑蓝;春翠;靖柏;夜蕾;冰夏;梦松;书雪;乐枫;念薇;\
    靖雁;寻春;恨山;从寒;忆香;觅波;静曼;凡旋;以亦;念露;芷蕾;千兰;新波;代真;新蕾;雁玉;冷卉;紫山;千琴;\
    恨天;傲芙;盼山;怀蝶;冰兰;山柏;翠萱;恨松;问旋;从南;白易;问筠;如霜;半芹;丹珍;冰彤;亦寒;寒雁;怜云;\
    寻文;乐丹;翠柔;谷山;之瑶;冰露;尔珍;谷雪;乐萱;涵菡;海莲;傲蕾;青槐;冬儿;易梦;惜雪;宛海;之柔;夏青;\
    亦瑶;妙菡;春竹;痴梦;紫蓝;晓巧;幻柏;元风;冰枫;访蕊;南春;芷蕊;凡蕾;凡柔;安蕾;天荷;含玉;书兰;雅琴;\
    书瑶;春雁;从安;夏槐;念芹;怀萍;代曼;幻珊;谷丝;秋翠;白晴;海露;代荷;含玉;书蕾;听白;访琴;灵雁;秋春;\
    雪青;乐瑶;含烟;涵双;平蝶;雅蕊;傲之;灵薇;绿春;含蕾;从梦;从蓉;初丹;听兰;听蓉;语芙;夏彤;凌瑶;忆翠;\
    幻灵;怜菡;紫南;依珊;妙竹;访烟;怜蕾;映寒;友绿;冰萍;惜霜;凌香;芷蕾;雁卉;迎梦;元柏;代萱'
    ming = ming.split(';')
    xing=[i for i in xing]
    with open('test.txt','w',encoding='utf-8') as f:
        for x in range(num):
            a = random.randint(13000000000, 13999999999)
            b = random.sample('zyxwvutsrqponmlkjihgfedcba', 6)
            b=''.join(b)+'@163.com'
            print(random.sample(xing,1),random.sample(ming,1))
            c= ''.join(random.sample(xing,1))+''.join(random.sample(ming,1))
            f.write(f'{a} {b} {c} \n')
    print('success!')

start_time=time.time()
creat_file(1111111)
end_time=time.time()
print(f"take{start_time-end_time}s")

